# Pandas

In [1]:
import pandas as pd
import numpy as np

# Pandas Serileri

In [3]:
data=[1923,1868,1922]

In [4]:
index=["Türkiye","Japonya","SSCB"]

In [5]:
seri=pd.Series(data=data)
seri

0    1923
1    1868
2    1922
dtype: int64

In [6]:
pd.Series(data=data,index=index)

Türkiye    1923
Japonya    1868
SSCB       1922
dtype: int64

In [7]:
countires=pd.Series(data,index)

In [12]:
countires

Türkiye    1923
Japonya    1868
SSCB       1922
dtype: int64

# Dict ile

In [9]:
countries={
    "Türkiye":1923,
    "Japonya":1968,
    "SSCB":1922
}

In [10]:
countries

{'Türkiye': 1923, 'Japonya': 1968, 'SSCB': 1922}

In [11]:
type(countries)

dict

In [13]:
pd.Series(countries)

Türkiye    1923
Japonya    1968
SSCB       1922
dtype: int64

In [14]:
type(countries)

dict

In [15]:
countries

{'Türkiye': 1923, 'Japonya': 1968, 'SSCB': 1922}

In [16]:
countries=pd.Series(countries)

In [17]:
type(countries)

pandas.core.series.Series

In [18]:
countries[2]

C:\Users\mustafa\AppData\Local\Temp\ipykernel_20688\315654508.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  countries[2]

1922

In [19]:
countries["Japonya"]

1968

In [20]:
countries[2]

C:\Users\mustafa\AppData\Local\Temp\ipykernel_20688\315654508.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  countries[2]

1922

In [21]:
countries

Türkiye    1923
Japonya    1968
SSCB       1922
dtype: int64

In [ ]:
countries+100 #her değeri 100 arttıır.

Türkiye    2023
Japonya    2068
SSCB       2022
dtype: int64

In [23]:
countries.keys()

Index(['Türkiye', 'Japonya', 'SSCB'], dtype='object')

In [26]:
countries.values

array([1923, 1968, 1922], dtype=int64)

In [30]:
countries_2={
    "Türkiye":100,
    "Almanya":1071,
    "Japonya": -2528,
    "ABD":1776
}

In [31]:
countries_2=pd.Series(countries_2)

In [32]:
countries_2

Türkiye     100
Almanya    1071
Japonya   -2528
ABD        1776
dtype: int64

In [33]:
countries_2+countires

ABD           NaN
Almanya       NaN
Japonya    -660.0
SSCB          NaN
Türkiye    2023.0
dtype: float64

In [34]:
countries_2.add(countires,fill_value=0)

ABD        1776.0
Almanya    1071.0
Japonya    -660.0
SSCB       1922.0
Türkiye    2023.0
dtype: float64

# Dataframes

In [38]:
np.random.seed(9)
sayi=np.random.randint(0,50, (5,4))
sayi

array([[28, 22,  1, 22],
       [40, 49, 27, 33],
       [29, 28,  0, 46],
       [24, 10, 29, 42],
       [12, 18, 22,  1]])

In [37]:
akdeniz=["Isparta","Antalya","Konya","Maraş","Adana"]

mevsim=["Bahar","Yaz","Kış","Güz"]

In [39]:
pd.DataFrame(data=sayi)

    0   1   2   3
0  28  22   1  22
1  40  49  27  33
2  29  28   0  46
3  24  10  29  42
4  12  18  22   1

In [40]:
type(sayi)

numpy.ndarray

In [41]:
df=pd.DataFrame(data=sayi)

In [42]:
type(df)

pandas.core.frame.DataFrame

In [43]:
df=pd.DataFrame(data=sayi,index=akdeniz,columns=mevsim)
df

         Bahar  Yaz  Kış  Güz
Isparta     28   22    1   22
Antalya     40   49   27   33
Konya       29   28    0   46
Maraş       24   10   29   42
Adana       12   18   22    1

In [44]:
df.info

<bound method DataFrame.info of          Bahar  Yaz  Kış  Güz
Isparta     28   22    1   22
Antalya     40   49   27   33
Konya       29   28    0   46
Maraş       24   10   29   42
Adana       12   18   22    1>

In [45]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, Isparta to Adana
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Bahar   5 non-null      int32
 1   Yaz     5 non-null      int32
 2   Kış     5 non-null      int32
 3   Güz     5 non-null      int32
dtypes: int32(4)
memory usage: 292.0+ bytes

In [46]:
df.describe()

           Bahar       Yaz        Kış        Güz
count   5.000000   5.00000   5.000000   5.000000
mean   26.600000  25.40000  15.800000  28.800000
std    10.089599  14.72413  14.202113  18.074844
min    12.000000  10.00000   0.000000   1.000000
25%    24.000000  18.00000   1.000000  22.000000
50%    28.000000  22.00000  22.000000  33.000000
75%    29.000000  28.00000  27.000000  42.000000
max    40.000000  49.00000  29.000000  46.000000